axfnull/N32G401_CodeLib/firmware/n32g401f8s7_1_std_periph_driver/src/n32g401f8s7_1_gpio.c
/**
*     Copyright (c) 2022, Nations Technologies Inc.
* 
*     All rights reserved.
*
*     This software is the exclusive property of Nations Technologies Inc. (Hereinafter 
* referred to as NATIONS). This software, and the product of NATIONS described herein 
* (Hereinafter referred to as the Product) are owned by NATIONS under the laws and treaties
* of the People's Republic of China and other applicable jurisdictions worldwide.
*
*     NATIONS does not grant any license under its patents, copyrights, trademarks, or other 
* intellectual property rights. Names and brands of third party may be mentioned or referred 
* thereto (if any) for identification purposes only.
*
*     NATIONS reserves the right to make changes, corrections, enhancements, modifications, and 
* improvements to this software at any time without notice. Please contact NATIONS and obtain 
* the latest version of this software before placing orders.

*     Although NATIONS has attempted to provide accurate and reliable information, NATIONS assumes 
* no responsibility for the accuracy and reliability of this software.
* 
*     It is the responsibility of the user of this software to properly design, program, and test 
* the functionality and safety of any application made of this information and any resulting product. 
* In no event shall NATIONS be liable for any direct, indirect, incidental, special,exemplary, or 
* consequential damages arising in any way out of the use of this software or the Product.
*
*     NATIONS Products are neither intended nor warranted for usage in systems or equipment, any
* malfunction or failure of which may cause loss of human life, bodily injury or severe property 
* damage. Such applications are deemed, "Insecure Usage".
*
*     All Insecure Usage shall be made at user's risk. User shall indemnify NATIONS and hold NATIONS 
* harmless from and against all claims, costs, damages, and other liabilities, arising from or related 
* to any customer's Insecure Usage.

*     Any express or implied warranty with regard to this software or the Product, including,but not 
* limited to, the warranties of merchantability, fitness for a particular purpose and non-infringement
* are disclaimed to the fullest extent permitted by law.

*     Unless otherwise explicitly permitted by NATIONS, anyone may not duplicate, modify, transcribe
* or otherwise distribute this software for any purposes, in whole or in part.
*
*     NATIONS products and technologies shall not be used for or incorporated into any products or systems
* whose manufacture, use, or sale is prohibited under any applicable domestic or foreign laws or regulations. 
* User shall comply with any applicable export control laws and regulations promulgated and administered by 
* the governments of any countries asserting jurisdiction over the parties or transactions.
**/
 
/**
*\*\file n32g401f8s7_1_gpio.c
*\*\author Nations
*\*\version v1.0.0
*\*\copyright Copyright (c) 2022, Nations Technologies Inc. All rights reserved.
**/

#include "n32g401f8s7_1_gpio.h"


/**
 *\*\name   GPIO_Reset.
 *\*\fun    Reset the GPIOx peripheral registers to their default reset values.
 *\*\param  GPIOx :
 *\*\          - GPIOA
 *\*\          - GPIOB
 *\*\          - GPIOD
 *\*\return none
 */
void GPIO_Reset(GPIO_Module* GPIOx)
{
    if (GPIOx == GPIOA)
    {
        RCC_AHB_Peripheral_Reset(RCC_AHB_PERIPH_GPIOA);
    }
    else if (GPIOx == GPIOB)
    {
        RCC_AHB_Peripheral_Reset(RCC_AHB_PERIPH_GPIOB);
    }
    else if (GPIOx == GPIOD)
    {
        RCC_AHB_Peripheral_Reset(RCC_AHB_PERIPH_GPIOD);
    }
    else
    {
        return;
    }
}


/**
 *\*\name   GPIOA_Pin_Reset.
 *\*\fun    Reset the GPIOA peripheral registers to it's default reset values.
 *\*\param  pin :
 *\*\          - GPIO_PIN_0
 *\*\          - GPIO_PIN_1
 *\*\          - GPIO_PIN_2
 *\*\          - GPIO_PIN_3
 *\*\          - GPIO_PIN_4
 *\*\          - GPIO_PIN_5
 *\*\          - GPIO_PIN_6
 *\*\          - GPIO_PIN_7
 *\*\          - GPIO_PIN_9
 *\*\          - GPIO_PIN_10
 *\*\          - GPIO_PIN_13
 *\*\          - GPIO_PIN_14
 *\*\          - GPIO_PIN_ALL
 *\*\return none
 */
void GPIOA_Pin_Reset(uint16_t pin)
{
    uint32_t position = 0x00U;
    uint32_t current_pin = 0x00U;

    while((pin >> position) != 0)
    {
        /* Get the IO position */
        current_pin = (pin) & (IO_POSITION_MASK << position);

        if(current_pin)
        {
            if(position > GPIOA_MODE_POSITION)
            {
                /* Configure IO Direction in alternate Mode */
                GPIOA->PMODE |= (GPIO_AF_MODE << (position * MULTIPLIER_FACTOR_2));
            }
            else
            {
                /* Configure IO Direction in analog Mode */
                GPIOA->PMODE |= (GPIO_ANALOG_MODE << (position * MULTIPLIER_FACTOR_2));
            }

            /* Configure the default Alternate Function in current IO */
            if(position & AF_SELECTION_MASK)
            {
                GPIOA->AFH &= ~(GPIO_AF_MASK << ((position & (uint32_t)AF_WRITE_POSITION_MASK) * MULTIPLIER_FACTOR_4));
            }
            else
            {
                GPIOA->AFL &= ~(GPIO_AF_MASK << ((position & (uint32_t)AF_WRITE_POSITION_MASK) * MULTIPLIER_FACTOR_4));
            }

            /* Reset GPIO output type to push-pull output */
            GPIOA->POTYPE &= ~(GPIO_POTYPE_MASK << position);

            
            if(position == GPIOA_PUPD_POSITION1 || position == GPIOA_PUPD_POSITION2)
            {
                /* Reset the GPIO pull mode to pull-up */
                GPIOA->PUPD |= (GPIO_PU_MODE << (position * MULTIPLIER_FACTOR_2));  
            }
            else if(position == GPIOA_PUPD_POSITION3)
            {
                /* Reset the GPIO pull mode to pull-down */
                GPIOA->PUPD |= (GPIO_PD_MODE << (position * MULTIPLIER_FACTOR_2));  
            }
            else
            {
                /* Reset the GPIO pull mode to no-pull */
                GPIOA->PUPD &= ~(GPIO_PUPD_MASK << (position * MULTIPLIER_FACTOR_2));  
            }

            /* Reset the GPIO slew rate to slow */
            GPIOA->SR |= (GPIO_SR_SLOW << position);  

            /* Reset the GPIO driver strength to 8 mA */
            GPIOA->DS |= (GPIO_DRIVER_8MA << (position * MULTIPLIER_FACTOR_2));  
        }
        position++;
    }
}

/**
 *\*\name   GPIOB_Pin_Reset.
 *\*\fun    Reset the GPIOB peripheral registers to it's default reset values.
 *\*\param  pin :
 *\*\          - GPIO_PIN_1
 *\*\          - GPIO_PIN_ALL
 *\*\return none
 */
void GPIOB_Pin_Reset(uint16_t pin)
{
    uint32_t position = 0x00U;
    uint32_t current_pin = 0x00U;

    while((pin >> position) != 0)
    {
        /* Get the IO position */
        current_pin = (pin) & (IO_POSITION_MASK << position);

        if(current_pin)
        {
            /** Reset GPIO pin mode **/
            if((position == GPIOB_MODE_POSITION1) || (position == GPIOB_MODE_POSITION2))
            {
                /* Configure IO Direction in alternate Mode */
                GPIOB->PMODE |= (GPIO_AF_MODE << (position * MULTIPLIER_FACTOR_2));
            }
            else
            {
                /* Configure IO Direction in analog Mode */
                GPIOB->PMODE |= (GPIO_ANALOG_MODE << (position * MULTIPLIER_FACTOR_2));
            }

            /** Configure the default Alternate Function in current IO **/
            if(position & AF_SELECTION_MASK)
            {
                GPIOB->AFH &= ~(GPIO_AF_MASK << ((position & (uint32_t)AF_WRITE_POSITION_MASK) * MULTIPLIER_FACTOR_4));
            }
            else
            {
                GPIOB->AFL &= ~(GPIO_AF_MASK << ((position & (uint32_t)AF_WRITE_POSITION_MASK) * MULTIPLIER_FACTOR_4));
            }
            
            /* Reset GPIO output type to push-pull output */
            GPIOB->POTYPE &= ~(GPIO_POTYPE_MASK << position);

            if(position == GPIOB_PUPD_POSITION1)
            {
                /* Reset the GPIO pull mode to pull-up */
                GPIOB->PUPD |= (GPIO_PU_MODE << (position * MULTIPLIER_FACTOR_2));  
            }
            else
            {
                /* Reset the GPIO pull mode to no-pull */
                GPIOB->PUPD &= ~(GPIO_PUPD_MASK << (position * MULTIPLIER_FACTOR_2));  
            }

            /* Reset the GPIO slew rate to slow */
            GPIOB->SR |= (GPIO_SR_SLOW << position);  

            /* Reset the GPIO driver strength to 8 mA */
            GPIOB->DS |= (GPIO_DRIVER_8MA << (position * MULTIPLIER_FACTOR_2));  
        }
        position++;
    }
}


/**
 *\*\name   GPIOD_Pin_Reset.
 *\*\fun    Reset the GPIOD peripheral registers to it's default reset values.
 *\*\param  pin :
 *\*\          - GPIO_PIN_0
 *\*\          - GPIO_PIN_14
 *\*\          - GPIO_PIN_15
 *\*\          - GPIO_PIN_ALL
 *\*\return none
 */
void GPIOD_Pin_Reset(uint16_t pin)
{
    uint32_t position = 0x00U;
    uint32_t current_pin = 0x00U;

    while((pin >> position) != 0)
    {
        /* Get the IO position */
        current_pin = (pin) & (IO_POSITION_MASK << position);

        if(current_pin)
        {
            if(position == GPIOD_MODE_POSITION)
            {
                /* Configure IO Direction in analog Mode */
                GPIOD->PMODE |= (GPIO_INPUT_MODE << (position * MULTIPLIER_FACTOR_2));
            }
            else
            {
                /* Configure IO Direction in analog Mode */
                GPIOD->PMODE |= (GPIO_ANALOG_MODE << (position * MULTIPLIER_FACTOR_2));
            }

            /* Configure the default Alternate Function in current IO */
            if(position & AF_SELECTION_MASK)
            {
                GPIOD->AFH &= ~(GPIO_AF_MASK << ((position & (uint32_t)AF_WRITE_POSITION_MASK) * MULTIPLIER_FACTOR_4));
            }
            else
            {
                GPIOD->AFL &= ~(GPIO_AF_MASK << ((position & (uint32_t)AF_WRITE_POSITION_MASK) * MULTIPLIER_FACTOR_4));
            }

            /* Reset GPIO output type to push-pull output */
            GPIOD->POTYPE &= ~(GPIO_POTYPE_MASK << position);

            if(position == GPIOD_PUPD_POSITION1)
            {
                /* Reset the GPIO pull mode to pull-down */
                GPIOD->PUPD |= (GPIO_PD_MODE << (position * MULTIPLIER_FACTOR_2));  
            }
            else if(position >= GPIOD_PUPD_POSITION2)
            {
                /* Reset the GPIO pull mode to no-pull */
                GPIOD->PUPD &= ~(GPIO_PUPD_MASK << (position * MULTIPLIER_FACTOR_2));  
            }
            
            /* Reset the GPIO slew rate to slow */
            GPIOD->SR |= (GPIO_SR_SLOW << position);  

            /* Reset the GPIO driver strength to 8 mA */
            GPIOD->DS |= (GPIO_DRIVER_8MA << (position * MULTIPLIER_FACTOR_2)); 
        }
        position++;
    } 
}

/**
 *\*\name   AFIO_Mode_Reset.
 *\*\fun    Reset the AFIO mode.
 *\*\param  EXTI_line :
 *\*\          - EXTI_LINE_0   
 *\*\          - EXTI_LINE_1   
 *\*\          - EXTI_LINE_2   
 *\*\          - EXTI_LINE_3   
 *\*\          - EXTI_LINE_4   
 *\*\          - EXTI_LINE_5   
 *\*\          - EXTI_LINE_6   
 *\*\          - EXTI_LINE_7   
 *\*\          - EXTI_LINE_8   
 *\*\          - EXTI_LINE_9   
 *\*\          - EXTI_LINE_10  
 *\*\          - EXTI_LINE_11  
 *\*\          - EXTI_LINE_12  
 *\*\          - EXTI_LINE_13  
 *\*\          - EXTI_LINE_14  
 *\*\          - EXTI_LINE_15  
 *\*\          - EXTI_LINE_ALL 
 *\*\return none
 */
void AFIO_EXTI_Reset(uint16_t EXTI_line)
{
    uint32_t temp_value = 0x00U;
    uint32_t position = 0x00U;
    uint32_t current_line = 0x00U;

    while((EXTI_line >> position) != 0)
    {
        /* Get the IO position */
        current_line = (EXTI_line) & (IO_POSITION_MASK << position);

        if(current_line)
        {
            temp_value = (AFIO_EXTICFG_MASK << ((position & (uint32_t)AFIO_EXTI_POSITION_MASK) * MULTIPLIER_FACTOR_8));
            AFIO->EXTI_CFG[position >> SHIFT_EXTI] &= ~temp_value;
        }
        position++;
    }
}



/**
 *\*\name   GPIO_ALLPin_Reset.
 *\*\fun    Reset the GPIOx peripheral registers to their default reset values.
 *\*\param  none
 *\*\return none
 */
void GPIO_ALLPin_Reset(void) 
{
    /* Reset all pins on the GPIOA peripheral */
    GPIOA_Pin_Reset(GPIO_PIN_ALL);

