axfnull/N32G401_CodeLib/firmware/n32g401f8s7_1_std_periph_driver/src/n32g401f8s7_1_gpio.c
    /* PLOCKK write 0 */
    GPIOx->PLOCK = pin; 
    
    /* PLOCKK and PLOCKx write 1 */
    GPIOx->PLOCK = temp_value; 

    /* PLOCKK read 0 */
    temp_value = GPIOx->PLOCK;
    
    /* PLOCKK read 1 */
    temp_value = GPIOx->PLOCK;
}


/**
 *\*\name   GPIO_Pin_Remap_Set.
 *\*\fun    Pin remapping configuration.
 *\*\param  port_source :
 *\*\          - GPIOA_PORT_SOURCE
 *\*\          - GPIOB_PORT_SOURCE
 *\*\          - GPIOD_PORT_SOURCE
 *\*\param  pin_source :
 *\*\          - GPIO_PIN_SOURCE0
 *\*\          - GPIO_PIN_SOURCE1
 *\*\          - GPIO_PIN_SOURCE2
 *\*\          - GPIO_PIN_SOURCE3
 *\*\          - GPIO_PIN_SOURCE4
 *\*\          - GPIO_PIN_SOURCE5
 *\*\          - GPIO_PIN_SOURCE6
 *\*\          - GPIO_PIN_SOURCE7
 *\*\          - GPIO_PIN_SOURCE8
 *\*\          - GPIO_PIN_SOURCE9
 *\*\          - GPIO_PIN_SOURCE10
 *\*\          - GPIO_PIN_SOURCE11
 *\*\          - GPIO_PIN_SOURCE12
 *\*\          - GPIO_PIN_SOURCE13
 *\*\          - GPIO_PIN_SOURCE14
 *\*\          - GPIO_PIN_SOURCE15
 *\*\param  alternate_function :
 *\*\          - GPIO_AF0_SWDIO        SWDIO Alternate Function mapping   
 *\*\          - GPIO_AF0_SWCLK        SWCLK Alternate Function mapping   
 *\*\
 *\*\          - GPIO_AF1_SPI1         SPI1 Alternate Function mapping    
 *\*\          - GPIO_AF1_SPI2         SPI2 Alternate Function mapping    
 *\*\          - GPIO_AF1_TIM8         TIM8 Alternate Function mapping    
 *\*\          - GPIO_AF1_UART1       UART1 Alternate Function mapping  
 *\*\
 *\*\          - GPIO_AF2_TIM5         TIM5 Alternate Function mapping    
 *\*\          - GPIO_AF2_TIM1         TIM1 Alternate Function mapping    
 *\*\          - GPIO_AF2_UART1       UART1 Alternate Function mapping  
 *\*\          - GPIO_AF2_SPI2         SPI2 Alternate Function mapping    
 *\*\
 *\*\          - GPIO_AF3_TIM2         TIM2 Alternate Function mapping    
 *\*\          - GPIO_AF3_SPI2         SPI2 Alternate Function mapping    
 *\*\          - GPIO_AF3_TIM3         TIM3 Alternate Function mapping    
 *\*\          - GPIO_AF3_TIM1         TIM1 Alternate Function mapping    
 *\*\
 *\*\          - GPIO_AF4_EVENTOUT     EVENTOUT Alternate Function mapping
 *\*\          - GPIO_AF4_USART2       USART2 Alternate Function mapping  
 *\*\
 *\*\          - GPIO_AF5_USART2       USART2 Alternate Function mapping  
 *\*\          - GPIO_AF5_UART1       UART1 Alternate Function mapping  
 *\*\          - GPIO_AF5_SPI1         SPI1 Alternate Function mapping    
 *\*\
 *\*\          - GPIO_AF6_TIM2         TIM2 Alternate Function mapping    
 *\*\          - GPIO_AF6_I2C2         I2C2 Alternate Function mapping    
 *\*\          - GPIO_AF6_TIM4         TIM4 Alternate Function mapping    
 *\*\          - GPIO_AF6_TIM1         TIM1 Alternate Function mapping      
 *\*\          - GPIO_AF6_SPI2         SPI2 Alternate Function mapping    
 *\*\
 *\*\          - GPIO_AF7_TIM5         TIM5 Alternate Function mapping     
 *\*\          - GPIO_AF7_TIM8         TIM8 Alternate Function mapping     
 *\*\          - GPIO_AF7_I2C2         I2C2 Alternate Function mapping     
 *\*\          - GPIO_AF7_UART4        UART4 Alternate Function mapping     
 *\*\
 *\*\          - GPIO_AF8_TIM8         TIM8 Alternate Function mapping     
 *\*\          - GPIO_AF8_TIM5         TIM5 Alternate Function mapping    
 *\*\          - GPIO_AF8_I2C1         I2C1 Alternate Function mapping     
 *\*\          - GPIO_AF8_TIM1         TIM1 Alternate Function mapping        
 *\*\  
 *\*\          - GPIO_AF9_TIM8         TIM8 Alternate Function mapping     
 *\*\          - GPIO_AF9_TIM4         TIM4 Alternate Function mapping     
 *\*\          - GPIO_AF9_MCO          MCO Alternate Function mapping      
 *\*\          - GPIO_AF9_RTC          RTC Alternate Function mapping        
 *\*\
 *\*\          - GPIO_AF10_TIM1        TIM1 Alternate Function mapping     
 *\*\          - GPIO_AF10_TIM8        TIM8 Alternate Function mapping        
 *\*\          - GPIO_AF10_TIM4        TIM4 Alternate Function mapping     
 *\*\
 *\*\          - GPIO_AF11_UART4       UART4 Alternate Function mapping    
 *\*\          - GPIO_AF11_USART2      USART2 Alternate Function mapping   
 *\*\
 *\*\          - GPIO_AF12_LPTIM       LPTIM Alternate Function mapping    
 *\*\          - GPIO_AF12_BEEPER      BEEPER Alternate Function mapping   
 *\*\return none
 */
void GPIO_Pin_Remap_Set(uint8_t port_source, uint8_t pin_source, uint32_t alternate_function)
{
    uint32_t position = 0x00, temp_value = 0x00;
    GPIO_Module *GPIOx;

    /* Get Peripheral index */
    GPIOx = GPIO_GET_PERIPH(port_source);

    if(pin_source & (uint8_t)AF_SELECTION_MASK)
    {
        position = (uint32_t)(pin_source & (uint8_t)AF_WRITE_POSITION_MASK);

        /* Read GPIO_AFH register */
        temp_value = GPIOx->AFH;

        /* Reset corresponding bits */
        temp_value &= ~(GPIO_AF_MASK << (position * MULTIPLIER_FACTOR_4));

        /* Set corresponding bits */
        temp_value |= (alternate_function << (position * MULTIPLIER_FACTOR_4));

        /* Write to the GPIO_AFH register */
        GPIOx->AFH = temp_value;
    }
    else
    {
        position = (uint32_t)(pin_source & (uint8_t)AF_WRITE_POSITION_MASK);

        /* Read GPIO_AFL register */
        temp_value  = GPIOx->AFL;

        /* Reset corresponding bits */
        temp_value &= ~(GPIO_AF_MASK << (position * MULTIPLIER_FACTOR_4)); 

        /* Set corresponding bits */
        temp_value |= (alternate_function << (position * MULTIPLIER_FACTOR_4));

        /* Write to the GPIO_AFL register */
        GPIOx->AFL = temp_value;
    }
}

/**
 *\*\name   GPIO_EXTI_Line_Set.
 *\*\fun    Selects the GPIO pin used as EXTI Line.
 *\*\param  EXTI_line :
 *\*\          - EXTI_LINE_SOURCE0
 *\*\          - EXTI_LINE_SOURCE1
 *\*\          - EXTI_LINE_SOURCE2
 *\*\          - EXTI_LINE_SOURCE3
 *\*\          - EXTI_LINE_SOURCE4
 *\*\          - EXTI_LINE_SOURCE5
 *\*\          - EXTI_LINE_SOURCE6
 *\*\          - EXTI_LINE_SOURCE7
 *\*\          - EXTI_LINE_SOURCE8
 *\*\          - EXTI_LINE_SOURCE9
 *\*\          - EXTI_LINE_SOURCE10
 *\*\          - EXTI_LINE_SOURCE11
 *\*\          - EXTI_LINE_SOURCE12
 *\*\          - EXTI_LINE_SOURCE13
 *\*\          - EXTI_LINE_SOURCE14
 *\*\          - EXTI_LINE_SOURCE15
 *\*\param  pin_source :
 *\*\          - AFIO_EXTI_PA0
 *\*\          - AFIO_EXTI_PD0
 *\*\          - AFIO_EXTI_PA1
 *\*\          - AFIO_EXTI_PA2
 *\*\          - AFIO_EXTI_PA3
 *\*\          - AFIO_EXTI_PA4
 *\*\          - AFIO_EXTI_PA5
 *\*\          - AFIO_EXTI_PA6
 *\*\          - AFIO_EXTI_PA7
 *\*\          - AFIO_EXTI_PA9
 *\*\          - AFIO_EXTI_PA10
 *\*\          - AFIO_EXTI_PA13
 *\*\          - AFIO_EXTI_PA14
 *\*\          - AFIO_EXTI_PD14
 *\*\          - AFIO_EXTI_PA15
 *\*\          - AFIO_EXTI_PD15
 *\*\return none
 */
void GPIO_EXTI_Line_Set(uint8_t EXTI_line, uint32_t pin_source)
{
    AFIO->EXTI_CFG[(EXTI_line >> SHIFT_EXTI)] &= ~(AFIO_EXTI_CFG_MASK << ((uint32_t)((EXTI_line & (uint8_t)AFIO_EXTI_POSITION_MASK) * MULTIPLIER_FACTOR_8)));
    AFIO->EXTI_CFG[(EXTI_line >> SHIFT_EXTI)] |=  (pin_source << ((uint32_t)((EXTI_line & (uint8_t)AFIO_EXTI_POSITION_MASK) * MULTIPLIER_FACTOR_8)));
}


/**
 *\*\name   AFIO_SPI_NSS_Mode_Set.
 *\*\fun    Selects the alternate function SPIx NSS mode.
 *\*\param  AFIO_SPIx_NSS : 
 *\*\          choose which SPI configuration.
 *\*\          - AFIO_SPI1_NSS
 *\*\          - AFIO_SPI2_NSS
 *\*\param  SPI_nss_mode : 
 *\*\          specifies the SPI_NSS mode to be configured.
 *\*\          - AFIO_SPI_NSS_HIGH_IMPEDANCE
 *\*\          - AFIO_SPI_NSS_High_LEVEL
 *\*\return none
 */
void AFIO_SPI_NSS_Mode_Set(uint32_t AFIO_SPIx_NSS, uint32_t SPI_NSS_mode)
{
    uint32_t temp_value = 0x00U;

    temp_value = (AFIO->RMP_CFG & AFIO_RMP_CFG_MASK);

    if(SPI_NSS_mode != AFIO_SPI_NSS_HIGH_IMPEDANCE)
    {
        temp_value |= AFIO_SPIx_NSS;
    }
    else
    {
        temp_value &= ~AFIO_SPIx_NSS;
    }

