axfnull/N32G401_CodeLib/firmware/n32g401f8s7_1_std_periph_driver/src/n32g401f8s7_1_gpio.c
    AFIO->RMP_CFG = temp_value;
}


/**
 *\*\name   AFIO_ADC_External_Trigger_Remap_Set.
 *\*\fun    Configurate ADC external trigger.
 *\*\param  ADC_ETR_type : 
 *\*\          choose whether to configure rule conversion or injection conversion.
 *\*\          - AFIO_ADC_ETRI
 *\*\          - AFIO_ADC_ETRR
 *\*\param  ADC_trigger_remap : 
 *\*\          specifies the external trigger line be configured.
 *\*\          - AFIO_ADC_TRIG_EXTI_0
 *\*\          - AFIO_ADC_TRIG_EXTI_1
 *\*\          - AFIO_ADC_TRIG_EXTI_2
 *\*\          - AFIO_ADC_TRIG_EXTI_3
 *\*\          - AFIO_ADC_TRIG_EXTI_4
 *\*\          - AFIO_ADC_TRIG_EXTI_5
 *\*\          - AFIO_ADC_TRIG_EXTI_6
 *\*\          - AFIO_ADC_TRIG_EXTI_7
 *\*\          - AFIO_ADC_TRIG_EXTI_8
 *\*\          - AFIO_ADC_TRIG_EXTI_9
 *\*\          - AFIO_ADC_TRIG_EXTI_10
 *\*\          - AFIO_ADC_TRIG_EXTI_11
 *\*\          - AFIO_ADC_TRIG_EXTI_12
 *\*\          - AFIO_ADC_TRIG_EXTI_13
 *\*\          - AFIO_ADC_TRIG_EXTI_14
 *\*\          - AFIO_ADC_TRIG_EXTI_15
 *\*\          - AFIO_ADC_TRIG_TIM8_TRGO
 *\*\          - AFIO_ADC_TRIG_TIM8_CH4
 *\*\return none
 */
void AFIO_ADC_External_Trigger_Remap_Set(AFIO_ADC_ETRType ADC_ETR_type, AFIO_ADC_Trig_RemapType ADC_trigger_remap)
{
    uint32_t temp_value = 0x00U;

    if(ADC_ETR_type == AFIO_ADC_ETRI)
    {
        temp_value = AFIO->RMP_CFG;

        /* clear AFIO_RMP_CFG register ETRI bit */
        temp_value &= (~(AFIO_RMPCFG_ADC_MASK << AFIO_ADC_ETRI));

        /* if ADC_ETR_type is AFIO_ADC_ETRI then ADC_trigger_remap cannot be AFIO_ADC_TRIG_TIM8_TRGO */
        if(ADC_trigger_remap == AFIO_ADC_TRIG_TIM8_CH4)
        {
            /* select TIM8_CH4 line to connect */
            temp_value |= (AFIO_RMPCFG_ADC_MASK << AFIO_ADC_ETRI);
        }
        else
        {
            /* select which external line is connected */
            temp_value &= (~(AFIO_RMPCFG_EXTI_MASK << SHIFT_EXTI_ETRI));
            temp_value |= (ADC_trigger_remap << SHIFT_EXTI_ETRI);
        }
        AFIO->RMP_CFG = temp_value;
    }
    else if(ADC_ETR_type == AFIO_ADC_ETRR)
    {
        temp_value  = AFIO->RMP_CFG;

        /* clear AFIO_RMP_CFG register ETRR bit */
        temp_value &= (~(AFIO_RMPCFG_ADC_MASK << AFIO_ADC_ETRR));

        /* if ADC_ETR_type is AFIO_ADC_ETRR then ADC_trigger_remap cannot be AFIO_ADC_TRIG_TIM8_CH4 */
        if(ADC_trigger_remap == AFIO_ADC_TRIG_TIM8_TRGO)
        {
            /* select TIM8_TRGO line to connect */
            temp_value |= (AFIO_RMPCFG_ADC_MASK << AFIO_ADC_ETRR);
        }
        else
        {
            /* select which external line is connected */
            temp_value &= ~AFIO_RMPCFG_EXTI_MASK;
            temp_value |= ADC_trigger_remap;
        }
        AFIO->RMP_CFG = temp_value;
    }
}


/**
 *\*\name   AFIO_5V_Tolerance_Enable.
 *\*\fun    Enables 5V tolerance of GPIOA and GPIOB.
 *\*\param  tolerance_pin : 
 *\*\          - PA0_5V_TOLERANCE         
 *\*\          - PA1_5V_TOLERANCE         
 *\*\          - PA2_5V_TOLERANCE        
 *\*\          - PA3_5V_TOLERANCE         
 *\*\          - PA4_5V_TOLERANCE         
 *\*\          - PA5_5V_TOLERANCE         
 *\*\          - PA6_5V_TOLERANCE         
 *\*\          - PA7_5V_TOLERANCE        
 *\*\          - PB1_5V_TOLERANCE         
 *\*\return none
 */
void AFIO_5V_Tolerance_Enable(uint32_t tolerance_pin)
{
    AFIO->TOL5V_CFG &= ~tolerance_pin;
}

/**
 *\*\name   AFIO_5V_Tolerance_Disable.
 *\*\fun    Disables 5V tolerance of GPIOA and GPIOB.
 *\*\param  tolerance_pin : 
 *\*\          - PA0_5V_TOLERANCE         
 *\*\          - PA1_5V_TOLERANCE         
 *\*\          - PA2_5V_TOLERANCE        
 *\*\          - PA3_5V_TOLERANCE         
 *\*\          - PA4_5V_TOLERANCE         
 *\*\          - PA5_5V_TOLERANCE         
 *\*\          - PA6_5V_TOLERANCE         
 *\*\          - PA7_5V_TOLERANCE        
 *\*\          - PB1_5V_TOLERANCE         
 *\*\return none
 */
void AFIO_5V_Tolerance_Disable(uint32_t tolerance_pin)
{
    AFIO->TOL5V_CFG |= tolerance_pin;
}


/**
 *\*\name   AFIO_Filter_Stage_Ctrl.
 *\*\fun    Filtr stage control.
 *\*\param  filter : 
 *\*\          - AFIO_IOFITCFG     filter bypass       
 *\*\return none
 */
void AFIO_Filter_Stage_Ctrl(uint8_t filter)
{
    AFIO->FILT_CFG = (uint32_t)filter;
}


/**
 *\*\name   AFIO_EFT_Enable.
 *\*\fun    Enables EFT IE of port pins.
 *\*\param  GPIOx : 
 *\*\          - GPIOA         
 *\*\          - GPIOB         
 *\*\          - GPIOD  
 *\*\param  EFT_pin :       
 *\*\          - AFIO_PA0_EFT                 
 *\*\          - AFIO_PA1_EFT             
 *\*\          - AFIO_PA2_EFT              
 *\*\          - AFIO_PA3_EFT              
 *\*\          - AFIO_PA4_EFT               
 *\*\          - AFIO_PA5_EFT              
 *\*\          - AFIO_PA6_EFT               
 *\*\          - AFIO_PA7_EFT                
 *\*\          - AFIO_PA9_EFT                
 *\*\          - AFIO_PA10_EFT             
 *\*\          - AFIO_PA13_EFT             
 *\*\          - AFIO_PA14_EFT             
 *\*\          - AFIO_PB1_EFT               
 *\*\          - AFIO_PD0_EFT               
 *\*\          - AFIO_PD14_EFT              
 *\*\          - AFIO_PD15_EFT 
 *\*\return none
 */
void AFIO_EFT_Enable(GPIO_Module* GPIOx, uint32_t EFT_pin)
{
    uint32_t port;

    /* Get port index */
    port = ((uint32_t)GPIO_GET_INDEX(GPIOx));

    if(!(port & AFIO_EFT_SELECTION_MASK))
    {
        if(GPIOx == GPIOA)
        {
            AFIO->EFT_CFG1 |= EFT_pin;
        }
        else if(GPIOx == GPIOB)
        {
            AFIO->EFT_CFG1 |= EFT_pin;
        }
    }
    else
    {
        if(GPIOx == GPIOD)
        {
            AFIO->EFT_CFG2 |= EFT_pin;
        }
    }     
}


/**
 *\*\name   AFIO_EFT_Disable.
 *\*\fun    Disables EFT IE of port pins.
 *\*\param  GPIOx : 
 *\*\          - GPIOA         
 *\*\          - GPIOB         
 *\*\          - GPIOD  
 *\*\param  EFT_pin :       
 *\*\          - AFIO_PA0_EFT                 
 *\*\          - AFIO_PA1_EFT             
 *\*\          - AFIO_PA2_EFT              
 *\*\          - AFIO_PA3_EFT              
 *\*\          - AFIO_PA4_EFT               
 *\*\          - AFIO_PA5_EFT              
 *\*\          - AFIO_PA6_EFT               
 *\*\          - AFIO_PA7_EFT                
 *\*\          - AFIO_PA9_EFT                
 *\*\          - AFIO_PA10_EFT             
 *\*\          - AFIO_PA13_EFT             
 *\*\          - AFIO_PA14_EFT             
 *\*\          - AFIO_PB1_EFT               
 *\*\          - AFIO_PD0_EFT               
 *\*\          - AFIO_PD14_EFT              
 *\*\          - AFIO_PD15_EFT 
 *\*\return none
 */
void AFIO_EFT_Disable(GPIO_Module* GPIOx, uint32_t EFT_pin)
{
    uint32_t port;

    /* Get port index */
    port = ((uint32_t)GPIO_GET_INDEX(GPIOx));

