axfnull/N32G401_CodeLib/firmware/n32g401f8s7_1_std_periph_driver/src/n32g401f8s7_1_gpio.c
    if(!(port & AFIO_EFT_SELECTION_MASK))
    {
        if(GPIOx == GPIOA)
        {    
            AFIO->EFT_CFG1 &= ~EFT_pin; 
        }
        else if(GPIOx == GPIOB)
        {
            AFIO->EFT_CFG1 &= ~EFT_pin;
        }
    }
    else
    {
        if(GPIOx == GPIOD)
        {
            AFIO->EFT_CFG2 &= ~EFT_pin;
        }
    }
}



/**
 *\*\name   AFIO_Digital_EFT_Enable.
 *\*\fun    Enables digital EFT IE of port pins.
 *\*\param  GPIOx : 
 *\*\          - GPIOA         
 *\*\          - GPIOB         
 *\*\          - GPIOD  
 *\*\param  digital_EFT_pin :       
 *\*\          - AFIO_PA0_DIGEFT                 
 *\*\          - AFIO_PA1_DIGEFT             
 *\*\          - AFIO_PA2_DIGEFT              
 *\*\          - AFIO_PA3_DIGEFT              
 *\*\          - AFIO_PA4_DIGEFT               
 *\*\          - AFIO_PA5_DIGEFT              
 *\*\          - AFIO_PA6_DIGEFT               
 *\*\          - AFIO_PA7_DIGEFT                
 *\*\          - AFIO_PA9_DIGEFT                
 *\*\          - AFIO_PA10_DIGEFT             
 *\*\          - AFIO_PA13_DIGEFT             
 *\*\          - AFIO_PA14_DIGEFT              
 *\*\          - AFIO_PB1_DIGEFT               
 *\*\          - AFIO_PD0_DIGEFT               
 *\*\          - AFIO_PD14_DIGEFT              
 *\*\          - AFIO_PD15_DIGEFT  
 *\*\return none
 */
void AFIO_Digital_EFT_Enable(GPIO_Module* GPIOx, uint32_t digital_EFT_pin)
{
    uint32_t port;

    /* Get port index */
    port = ((uint32_t)GPIO_GET_INDEX(GPIOx));

    if(!(port & AFIO_EFT_SELECTION_MASK))
    {
        if(GPIOx == GPIOA)
        {
            AFIO->DIGEFT_CFG1 |= digital_EFT_pin;
        }
        else if(GPIOx == GPIOB)
        {
            AFIO->DIGEFT_CFG1 |= digital_EFT_pin;  
        }  
    }
    else
    {
        if(GPIOx == GPIOD)
        {
            AFIO->DIGEFT_CFG2 |= digital_EFT_pin;
        }
    }     
}


/**
 *\*\name   AFIO_Digital_EFT_Disable.
 *\*\fun    Disables digital EFT IE of port pins.
 *\*\param  GPIOx : 
 *\*\          - GPIOA         
 *\*\          - GPIOB         
 *\*\          - GPIOD  
 *\*\param  digital_EFT_pin :       
 *\*\          - AFIO_PA0_DIGEFT                 
 *\*\          - AFIO_PA1_DIGEFT             
 *\*\          - AFIO_PA2_DIGEFT              
 *\*\          - AFIO_PA3_DIGEFT              
 *\*\          - AFIO_PA4_DIGEFT               
 *\*\          - AFIO_PA5_DIGEFT              
 *\*\          - AFIO_PA6_DIGEFT               
 *\*\          - AFIO_PA7_DIGEFT                
 *\*\          - AFIO_PA9_DIGEFT                
 *\*\          - AFIO_PA10_DIGEFT             
 *\*\          - AFIO_PA13_DIGEFT             
 *\*\          - AFIO_PA14_DIGEFT              
 *\*\          - AFIO_PB1_DIGEFT               
 *\*\          - AFIO_PD0_DIGEFT               
 *\*\          - AFIO_PD14_DIGEFT
 *\*\          - AFIO_PD15_DIGEFT  
 *\*\return none
 */
void AFIO_Digital_EFT_Disable(GPIO_Module* GPIOx, uint32_t digital_EFT_pin)
{
    uint32_t port;

    /* Get port index */
    port = ((uint32_t)GPIO_GET_INDEX(GPIOx));

    if(!(port & AFIO_EFT_SELECTION_MASK))
    {
        if(GPIOx == GPIOA)
        {
            AFIO->DIGEFT_CFG1 &= ~digital_EFT_pin; 
        }
        else if(GPIOx == GPIOB)
        {
            AFIO->DIGEFT_CFG1 &= ~digital_EFT_pin;
        }
    }
    else
    {
        if(GPIOx == GPIOD)
        {
            AFIO->DIGEFT_CFG2 &= ~digital_EFT_pin;
        }
    }
}

